from src.reports import spending_by_category


def test_spending_by_category():
    data = [
        {
            "Категория": "Супермаркеты",
            "Сумма операции": -100.50,
        },
        {
            "Категория": "Супермаркеты",
            "Сумма операции": -200.25,
        },
        {
            "Категория": "Рестораны",
            "Сумма операции": -500.00,
        },
        {
            "Категория": "Супермаркеты",
            "Сумма операции": 50.00,
        },
    ]

    result = spending_by_category(data, "Супермаркеты")

    assert result == "Категория: Супермаркеты\nСумма трат: 300.75 руб."